app/views/posts/index.html.haml

SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = $1  [["post_id", 10]]
---
      = button_to "Edit", post, method: :get
      = link_to "Comments (" + post.comments.count.to_s + ")", post_comments_path(post)