app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
---
  def index
    @post = Post.find(params[:post_id])

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 10]]
INSERT INTO "comments" ("content", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "asfdasdf"], ["created_at", "2014-08-09 06:06:00.273137"], ["post_id", 10], ["updated_at", "2014-08-09 06:06:00.273137"]]
---
  def create
    params.permit!
    @post = Post.find(params[:post_id])
    @post.comments.create(params[:comment])

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 12]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 12]]
---
  def destroy
    Comment.find(params[:id]).destroy