app/controllers/posts_controller.rb

  def create #GET
    params.permit!
    Post.create(params[:post])
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "asdf"], ["created_at", "2014-08-07 05:27:32.308013"], ["title", "asdf"], ["updated_at", "2014-08-07 05:27:32.308013"]]

  def show #GET, shows page for indiv posts
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 2]]

  def destroy #DELETE
    Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def update #PUT, updates db
    params.permit!
    @post = Post.find(params[:id])
    @post.update_attributes(params[:post])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = 4  [["content", "asdf"], ["updated_at", "2014-08-08 01:56:59.835738"]]

  def edit #GET, shows page to edit
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]